# name = ' Ира Барбареуш'
# print(name.split())
# num = '1 2 3 4 '
# print(num.split())

# Практическое задание
# 1: Даны два произвольные списка. 
# Удалите из первого списка элементы присутствующие во втором списке.
#     Примечание. Списки создайте вручную, например так:
# my_list_1 = [2, 5, 8, 2, 12, 12, 4]
# my_list_2 = [2, 7, 12, 3]

my_list_1 = {1,2,3,4,5,6,7,8,9}

print(my_list_1)

my_list_2 = {2,4,6,8,10,12,14,16,18}
print(my_list_2)

result = my_list_1 - my_list_2
print(result)


    




